       01  PAYMENT-RECORD.
           05 PAYMENT-ID               PIC X(10).
           05 ACCOUNT-ID               PIC X(10).
           05 PAYMENT-AMOUNT           PIC X(10).
           05 PAYMENT-STATUS           PIC X(10).

